Revit 2024 API
GraphicsStyleType Enumeration
Describes the type of graphics style.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum GraphicsStyleType
Visual Basic
Public Enumeration GraphicsStyleType
Visual C++
public enum class GraphicsStyleType
Members
Member name | Description
Projection | Projection.
Cut | Cut.
See Also
Autodesk.Revit.DB Namespace